---
layout: post
title:  "为什么使用Ebaas构建企业应用软件"
date:   2018-02-11
visible: 1
---

<p class="intro">企业无论大小都有对应用软件的需要。应用软件为企业带来的价值包括：</p>

1．使企业的业务流程化，规范化。提高员工的工作效率，摆脱烦琐的低级劳动。从而减少出错率，提升企业的运营效率并降低成本。
2．使企业的管理者更清晰的了解企业的运营情况，真实数据的基础上做出决策分析，为企业的管理提供有力支持。

然而，每个企业或部门都有自己不同的实际需求。 发现市场上难以找到合适的应用软件。ERP或OA等管理软件大而全，功能繁杂，价格昂贵，而且并不适用。
采用定制开发的方式，很多企业自身不具备软件开发的能力。找软件公司定制开发的话，又面临各种问题，例如开发周期长，系统不稳定，后期维护困难等。造成定制开发软件的成功率非常低。

从企业的角度来看，理想的企业应用软件应该简单好用，又可以随时根据自己的需求变化方便地作相应的功能设置修改。无需像传统管理软件那样任何修改都要大动干戈。

从软件开发公司的角度来看，企业应用的个性化需要比重很大，造成不同项目的代码难以复用。定制开发成本愈来愈高，项目有限的经费难以支撑大量的开发投入。要完全按照客户的要求进行开发，项目就要亏本。否则就要造成客户不满意。即使开发项目得以交付使用，后期维护升级的工作非常艰巨。一旦遇到最初开发人员流失，软件后期修改基本上就难以维系。

从软件开发人员的角度来看，开发企业应用软件中大多数工作是重复性劳动，例如对数据的增、删、改、查等。这类开发工作耗费大量时间，没有太高的技术含量，因而没有太大的成就感。虽然有不少开源技术或工具（如ORM）能极大提高开发效率，但是任何对功能的小改动都免不了开发，编译，测试和发布这个费时费力的过程。一旦软件投入运行，对软件的修改就更难执行了。
这就是为什么我们提供Ebaas作为企业应用配置平台的原因。Ebaas是一款快速构建企业应用软件的平台。它提供零编码和业务模型驱动的开发方式，能够解决上述企业软件开发所面临的问题。

####Ebaas平台的主要特点如下：

•	构建端到端的企业应用：企业应用在架构上通常包含用户界面层，业务逻辑层和数据存储层。Ebaas针对各个层次的构建都提供了基于模型构建的方式，包括数据模型，工作流模型，业务逻辑，安全策略模型，用户界面模型，表单和报告模板等。Ebaas平台采用模型驱动的原理，自动构建完整的企业应用。
•	易学易用：Ebaas平台提供了图形化工具来配置各个模型，操作便捷。
•	技术先进：Ebaas平台单页应用（SPA）的架构构建应用。SPA是当前最新的基于Web应用的架构，采用Angular，JavaScript，HTML，Rest API等，确保所构建的应用所使用的技术不落伍。
•	支持多种数据库：Ebaas平台采用其特有的对象关系映射技术（ORM）将业务模型映射到关系数据库（Oracle或SQL Server）。也支持内嵌数据库，使得小型应用无需安装数据库。
•	动态更新：与其它自动代码生成的应用开发平台不同之处，Ebaas平台采用模型动态解析的设计。当模型修改后能自动更新软件，而无需进行编译，测试和发布的过程，从而快速应对业务需求的变化。

为了让您能在较短的时间内熟悉和掌握Ebaas平台的主要知识和功能，并应用到您自身的应用软件开发项目中。我们设计开发了这个“快速入门教程”。该教程分为多个短而精的小课程，循序渐进地介绍Ebass平台的主要功能。我们将通过开发一个应用例子（事务跟踪管理）来帮助您更好地理解Ebaas各项功能的作用。
考虑到您的时间，我们将对课程表示为“必要”和“可选”两个类型。标注为“必要”的课程建议您在第一轮学习中要阅读和操作。“可选”的课程可以在后续的实际应用开发中根据需要进行学习。
